Tekla.Structures.Drawing.AlongLinePlacing
The AlongLinePlacing class defines a placing where the object is
located and moved along a line defined by two points.

Tekla.Structures.Drawing.AlongLinePlacing.StartPoint
The start point of the line that the object is placed on.

Tekla.Structures.Drawing.AlongLinePlacing.EndPoint
The end point of the line that the object is placed on.

Tekla.Structures.Drawing.AlongLinePlacing.#ctor
Construct object

Tekla.Structures.Drawing.AlongLinePlacing.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Creates a new along line placing instance.
The given two points define the line to be used for the placing.
StartPoint: The first point of the line.
EndPoint: The second point of the line.

Tekla.Structures.Drawing.AlongLinePlacing.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.